import React from 'react';
import "./Footer.css";

function Footer() {
    return (
        <section className={'footer'}>
            <div className={'footer_wrapper'}>
                <div className={'footer_info'}>
                    <h5>Россия, Москва, 117997, ул. Вавилова, 19</h5>
                    <p>1997-2019 ПАО Сбербанк.</p>
                    <p>Генеральная лицензия на осуществление банковских операций от 11 августа 2015 года. Регистрационный номер - 1481.</p>
                    <p>Информация, обязательная к размещению</p>
                    <p>Раскрытие информации о банке как о профессиональном участнике рынка ценных бумаг</p>
                </div>
                <div className={'footer_links'}>
                    <div className={'footer_links_download'}>
                        <div className={'footer_links_download_div'}>
                            <svg width="35" height="35" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M3.92891 9.0968C2.06681 12.3281 3.25058 17.2318 5.30976 20.2051C6.33762 21.6917 7.37826 23.026 8.8036 23.026C8.83046 23.026 8.8574 23.0255 8.88499 23.0244C9.55465 22.9977 10.0386 22.7915 10.5065 22.5923C11.0318 22.3684 11.5751 22.1369 12.4272 22.1369C13.2379 22.1369 13.7553 22.3609 14.2556 22.5774C14.7487 22.7907 15.2566 23.0114 16.0071 22.9973C17.6126 22.9674 18.5983 21.5276 19.468 20.2574C20.3756 18.9311 20.8308 17.6434 20.9844 17.1513L20.9906 17.1318C21.0199 17.0443 20.9786 16.9488 20.8947 16.9103C20.8924 16.9093 20.8839 16.9057 20.8815 16.9047C20.5988 16.7891 18.1187 15.6889 18.0927 12.6902C18.0685 10.2539 19.9532 8.96371 20.3312 8.72987L20.3488 8.71889C20.3897 8.69253 20.4183 8.65072 20.4279 8.60291C20.4376 8.55518 20.4275 8.50549 20.4001 8.46534C19.0991 6.56157 17.1052 6.27465 16.3025 6.24013C16.186 6.22851 16.0658 6.22266 15.945 6.22266C15.0022 6.22266 14.0989 6.57876 13.3733 6.86488C12.8724 7.06239 12.4398 7.23297 12.1414 7.23297C11.8061 7.23297 11.371 7.0603 10.8671 6.8604C10.1933 6.59298 9.42964 6.28996 8.62118 6.28996C8.6019 6.28996 8.58291 6.29018 8.5642 6.29054C6.68441 6.3182 4.90817 7.39365 3.92891 9.0968Z" fill="white"/>
                                <path d="M16.3041 1.00014C15.1657 1.0465 13.8002 1.74722 12.984 2.70322C12.2904 3.50677 11.6128 4.84653 11.7913 6.19698C11.8025 6.28148 11.8712 6.34669 11.9562 6.35326C12.0331 6.35925 12.1115 6.36229 12.1896 6.36236C13.3027 6.36236 14.5034 5.74657 15.3235 4.75504C16.1865 3.70804 16.6229 2.36438 16.4909 1.16082C16.4805 1.06651 16.3975 0.996456 16.3041 1.00014Z" fill="white"/>
                            </svg>
                            <p>Загрузите в App Store</p>
                        </div>
                        <div className={'footer_links_download_div'}>
                            <svg width="35" height="35" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M4.85 2.80005L13.5125 11.4L15.8875 9.02505L5.3875 2.96255C5.2125 2.86099 5.025 2.80474 4.85 2.80005ZM4.125 3.20005C4.04688 3.33911 4 3.50317 4 3.68755V20.4C4 20.5344 4.02813 20.6547 4.075 20.7625L12.9375 11.9625L4.125 3.20005ZM16.6125 9.43755L14.075 11.9625L16.6125 14.475L19.7125 12.7C20.1531 12.4454 20.2156 12.1219 20.2125 11.95C20.2078 11.6657 20.0281 11.4 19.725 11.2375C19.4609 11.0954 17.5 9.95317 16.6125 9.43755ZM13.5125 12.525L4.775 21.1875C4.92031 21.1797 5.07813 21.1485 5.225 21.0625C5.56719 20.8641 12.4875 16.8625 12.4875 16.8625L15.9 14.9L13.5125 12.525Z" fill="white"/>
                            </svg>
                            <p>Загрузите в Google Play</p>
                        </div>
                    </div>
                    <div className={'footer_links_social'}>
                        <a href="https://www.google.com/"><i className="fa fa-facebook"></i></a>
                        <a href="https://www.google.com/"><i className="fa fa-twitter"></i></a>
                        <a href="https://www.google.com/"><i className="fa fa-vk"></i></a>
                        <a href="https://www.google.com/"><i className="fa fa-instagram"></i></a>
                    </div>
                </div>
            </div>
        </section>
    )
}

export default Footer;